Revit 2027 API
ElectricalDemandFactorDefinition.GetValues Method
 Provides access to the value set stored with this demand factor definition
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElectricalDemandFactorValue> GetValues()
Public Function GetValues As ICollection(Of ElectricalDemandFactorValue)
public:
ICollection<ElectricalDemandFactorValue^>^ GetValues()
member GetValues : unit -> ICollection<ElectricalDemandFactorValue>
Return Value
ICollection<ElectricalDemandFactorValue>
See Also
Reference
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace